Revit 2027 API
SharedParameterElement.Lookup Method
 Finds the shared parameter element that corresponds to the given Guid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static SharedParameterElement Lookup(
	Document document,
	Guid guidValue
)
Public Shared Function Lookup (
	document As Document,
	guidValue As Guid
) As SharedParameterElement
public:
static SharedParameterElement^ Lookup(
	Document^ document,
	Guid guidValue
)
static member Lookup :
        document : Document *
        guidValue : Guid -> SharedParameterElement
Parameters
document Document
 The document.
guidValue Guid
 Shared parameter Guid.
Return Value
SharedParameterElement
 The retrieved shared parameter instance, or null if the matching element is not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SharedParameterElement Class
Autodesk.Revit.DB Namespace